config.org
#+TITLE:		config
#+SUBTITLE: Emacs configuration using org-babel
#+AUTHOR:   Johannes Nauta
#+STARTUP:  indent

* Literate Emacs configuration
Welcome to my literate Emacs configuration using =org-babel=.

** How to use this literal program
+ Pull this file from my [[https://github.com/github-jnauta/emacs-config][Github repository]]
+ =org-babel= should already be installed when using a version of Emacs >=24 
+ Replace the contents of your =~/.emacs.d/init.el= with one line
#+begin_src emacs-lisp
(org-babel-load-file "~/.emacs.d/config.org")
#+end_src
+ Enjoy Emacs

Note that some of the libraries that are used might need to be installed. If
that is the case, simply =M-x package-install= the particular package that
raises an error.
  
* =use-package=: The package manager
=use-package= is my current bread-and-butter for installing packages to use with
Emacs. It not only allows you to install packages, but allows configuring the
packages as well. This is often done lazily, so you get much more performance
out of Emacs when you let =use-package= do all the configuration when possible.
First we need to use the built-in package manager to actually download
=use-package= when it is not available.
#+begin_src emacs-lisp :tangle yes
  ;; Use the built-in package manager and specify archive
  (require 'package)
  (add-to-list 'package-archives
               '("melpa" . "http://melpa.org/packages/") t)
  ;; Initialize built-in package management
  (package-initialize)
  ;; Install use-package if not available
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))
#+end_src

Then we can actually load =use-package=
#+begin_src emacs-lisp :tangle yes
  ;; Load use-package by requiring it, to ensure it has been loaded
  (eval-when-compile
    (require 'use-package))
#+end_src

* Changing Emacs default behavior
** Ensure environment variables inside Emacs look the same as in the shell
In some cases, e.g. when not starting Emacs from the terminal, Emacs' shell has
different environment variables than the user's shell. This is inconvenient as
it might result in some packages not finding the binaries of installed
libraries. A prime example is LaTeX, of which the =texlive= installation is
exported to the ="$PATH"= variable. Therefore, we use =exec-path-from-shell= to
ensure that Emacs's environment variables are the same as in the shell.
#+begin_src emacs-lisp :tangle yes
  (use-package exec-path-from-shell
    :ensure t)
  ;; Sets $MANPATH, $PATH and exec-path from your shell, only when using the GUI.
  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize))
#+end_src
** Suppressing default behaviors
There are some default behaviors which are just annoying, such as the startup
splash screen or the sound on error or EOF. We can suppress some more things
while we're at it.
#+begin_src emacs-lisp :tangle yes
  (setq inhibit-startup-message t)  ;; Suppress startup splash screen
  (setq ring-bell-function 'ignore) ;; Suppress sound on error or EOF
  (menu-bar-mode -1)                ;; Turn off menu bar
  (tool-bar-mode -1)                ;; Turn off tool bar
  (setq scroll-conservatively 100)  ;; Make scrolling better
  (show-paren-mode 1)               ;; Highlight matching parentheses
#+end_src

** Enabling default behaviors
In contrast, some behavior is not turned on by default, so we do that here
#+begin_src emacs-lisp :tangle yes
  (global-display-line-numbers-mode 1)	;; Display line numbers in every buffer
  (defalias 'yes-or-no-p 'y-or-n-p)     ;; All confirmations to single letters
  (delete-selection-mode 1)             ;; Replace highlighted/selected text
  ;; Build a list of recently opened files
  (recentf-mode 1)
  (setq recentf-max-menu-items 25)
  (setq recentf-max-saved-items 25)
#+end_src

** Specifying other defaults
Finally, there are some defaults that are sensible to set, such as the TAB
width, among others. You can define other global keybindings here as well, as
long as these are not originating from a package that is handled by
=use-package=. These should be handled by =use-package= itself when loaded.
#+begin_src emacs-lisp :tangle yes
  (setq-default indent-tabs-mode nil)						;; Spaces instead of tabs
  (setq-default tab-width 2)			              ;; Default tab width
  (setq-default fill-column 80)                 ;; Default column width
  (setq indent-line-function 'insert-tab)       ;; Indent current line(s) according to current major mode
  ;; Font and font size
  (set-face-attribute 'default nil :font "Roboto Mono Medium")
  (set-face-attribute 'default nil :height 115)
#+end_src

*** Global keybindings unrelated to =use-package=
#+begin_src emacs-lisp :tangle yes
(global-set-key (kbd "M-o") #'other-window)
#+end_src

** Changing where backups are stored
Emacs, just like Vim, makes regular backups of file that are undergoing active
editing. This feature is very nice as it might save you at some point when you
make a mistake. However, the Emacs backup files quickly clutter your inventory
and make you constantly include them in a =.gitignore=, as you do not want these
to fill your repositories. Much better behavior is to actually store them in a
separate directory from which you can easily retrieve them if you have to.
If you wish, you can also tell Emacs how many versions you wish to keep, but I
just keep with the defaults (2) for now.
#+begin_src emacs-lisp :tangle yes
  (setq backup-directory-alist '(("." . "~/.emacs.d/backup"))
        backup-by-copying t    ; Don't delink hardlinks
        version-control t      ; Use version numbers on backups
        delete-old-versions t  ; Automatically delete excess backups
        ;; kept-new-versions 5    ; how many of the newest versions to keep
        ;; kept-old-versions 5    ; and how many of the old
        )
#+end_src

** Switching between windows
When programming I often have more than one window open. When you split a window
vertically using =C-x 3= the default behavior is to keep the focus (the
cursor) in the previous window. This is annoying. Luckily, there has been a
[[https://github.com/daedreth/UncleDavesEmacs/blob/master/config.org][programmer]] that was equally annoyed (but much more versed in emacs-lisp) and
wrote some nice functions to deal with this. Note that I only include the
vertical split as I basically never find myself splitting horizontally.
#+begin_src emacs-lisp :tangle yes
  (defun split-and-follow-vertically ()
    (interactive)
    (split-window-right)
    (balance-windows)
    (other-window 1))
  (global-set-key (kbd "C-x 3") 'split-and-follow-vertically)
#+end_src

** Showing emoji
As is know, emoji are critical for developers and scientists. But really, they
often explain a concept in a very concise manner and are incredibly useful when
used sparingly. The font that I have chosen personally ([[https://fonts.google.com/specimen/Roboto+Mono][Roboto Mono]]) does not
contain emoji support (as far as I know). So, we need to set the emoji font as
described [[https://github.com/emacs-lsp/lsp-mode/issues/2291#issuecomment-813097394][here]].
#+begin_src emacs-lisp :tangle yes
  ;; Emoji: 😄, 🤦, 🏴
  (set-fontset-font t 'symbol "Apple Color Emoji")
  (set-fontset-font t 'symbol "Noto Color Emoji" nil 'append)
  (set-fontset-font t 'symbol "Segoe UI Emoji" nil 'append)
  (set-fontset-font t 'symbol "Symbola" nil 'append)
#+end_src

* Adding a terminal to Emacs
When programming I often find myself reaching for a terminal window to, for
example, quickly install a package using =apt=, browsing through my current
working directory (although I should probably do this using Emacs...), and many
other things. As we do not want to leave the safety of our carefully crafted
Emacs environment, we need a terminal window. I currently use
[[https://github.com/akermu/emacs-libvterm][vterm]], as I found
it provides the most complete terminal experience. Do note that it is still in
α-stage, so please be aware of (fundamental) changes down the line!
#+begin_src emacs-lisp :tangle yes
  (use-package vterm
    :ensure t
    :init
    (setq vterm-timer-delay 0.01))
#+end_src
Afterwards you might want to [[https://github.com/akermu/emacs-libvterm#shell-side-configuration][configure the shell]] as well.
Additionally we choose a global key combination to open vterm, in this case
=C-`=.
#+begin_src emacs-lisp :tangle yes
(global-set-key (kbd "C-`") `vterm)
#+end_src

* Visual configurations
** Color theme
Of course, no editor is your own when it does not look like your own. The
specific theme is my personal preference, so please feel free to change it to a
theme that better suits your needs.
[[https://github.com/bbatsov/zenb
urn-emacs][Zenburn]] for Emacs is a direct port of the Zenburn theme originally created for
vim. I (and others) think it is one of the best low contrast color themes out
there that is super easy on the eyes and has pastel colors!
#+begin_src emacs-lisp :tangle yes
  (use-package zenburn-theme
    :ensure t
    :config (load-theme 'zenburn t))
#+end_src

However, as I *really* like pastel colors, the [[https://github.com/mvarela/Sunburn-Theme][Sunburn]] color theme scratches the
right itch as it includes more shades of gray and purple -- but still very
pastel! Sadly, it is not available on ELPA/MELPA, so we need to install and load
in manually.
NOTE: Although this theme has some *really* nice colors, it feels less polished
and easy on the eyes that Zenburn. It would be very nice to, at some point in
the future, combine the two to create the 'ultimate' /burn/-theme.
#+begin_src emacs-lisp :tangle no
  (add-to-list 'custom-theme-load-path "~/.emacs.d/themes/sunburn-theme-20231101.1")
  (load-theme 'sunburn)
#+end_src

Catppuccin also has a nice range of pastel colors in four different 'flavors'.
#+begin_src emacs-lisp :tangle no
  (add-to-list 'custom-theme-load-path "~/.emacs.d/themes/catppuccin-theme-20231101.1")
  (load-theme 'catppuccin t)
  (setq catppuccin-flavor 'frappe)
  (catppuccin-reload)
#+end_src
NOTE: Although this theme has great colors, there are some things that are not
wel configured. Similar to the Sunburn theme above, it needs some more work to
actually fit my preferred style, although it has some potential!

** Change the startup screen
#+begin_src emacs-lisp :tangle yes
  (use-package dashboard
    :ensure t
    :config
    (dashboard-setup-startup-hook))
  ;; Set the title
  (setq dashboard-banner-logo-title "Welcome Johannes")
  ;; Set the banner
  (setq dashboard-startup-banner 'logo)
  ;; Center content
  (setq dashboard-center-content t)
  ;; Customize widgets
  (setq dashboard-items '((recents . 5)
                          (bookmarks . 5)))
  ;; Disable random footnote
  (setq dashboard-set-footer nil)
#+end_src

** Change how [[https://github.com/akermu/emacs-libvterm][vterm]] is displayed when opened
The vterm normally opens (I think?) in an already opened buffer. This is often
unwanted as you want to use the terminal on the side while keeping your current
active buffer open. My personal preference is to open the terminal on the bottom
-- mainly because I am used to that from my VSCode days.
#+begin_src emacs-lisp :tangle yes
  (add-to-list 'display-buffer-alist
               '("\*vterm\*"
                 (display-buffer-in-side-window)
                 (window-height . 0.275)         ;; Specify fraction of window height
                 (side . bottom)
                 (slot . 0)))
#+end_src

** Change the modeline
The modeline in Emacs is the single-line below each buffer in a window. It can
display important information on the opened file, such as the Git branch, the
filename, and [[https://www.emacswiki.org/emacs/ModeLine][much more]]. While I have played around with some configurations, I
find the default modeline quite respectable, and tweaking the modeline was quite
difficult.
So, current modifications is just to include the column number in the modeline.
#+begin_src emacs-lisp :tangle yes
  (setq column-number-mode t)
#+end_src
In some cases, the modeline becomes too full (looking at you =lsp-mode=). We can
hide (i.e. [[https://github.com/myrjola/diminish.el][diminish]]) their appearance while they still work for us in the
background. This is useful for many packages that are basically always loaded,
like snippets, =which-key=, etc.
#+begin_src emacs-lisp :tangle yes
  (use-package diminish
    :ensure t)
  (diminish 'eldoc-mode)
  (diminish 'visual-line-mode)
#+end_src

