config.el
;; Use the built-in package manager and specify archive
(require 'package)
(add-to-list 'package-archives
             '("melpa" . "http://melpa.org/packages/") t)
;; Initialize built-in package management
(package-initialize)
;; Install use-package if not available
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

;; Load use-package by requiring it, to ensure it has been loaded
(eval-when-compile
  (require 'use-package))

(setq inhibit-startup-message t)  ;; Suppress startup splash screen
(setq ring-bell-function 'ignore) ;; Suppress sound on error or EOF
(menu-bar-mode -1)                ;; Turn off menu bar
(tool-bar-mode -1)                ;; Turn off tool bar
(setq scroll-conservatively 100)  ;; Make scrolling better
(show-paren-mode 1)               ;; Highlight matching parentheses

(global-display-line-numbers-mode 1)	;; Display line numbers in every buffer
(defalias 'yes-or-no-p 'y-or-n-p)     ;; All confirmations to single letters
(delete-selection-mode 1)             ;; Replace highlighted/selected text
;; Build a list of recently opened files
(recentf-mode 1)
(setq recentf-max-menu-items 25)
(setq recentf-max-saved-items 25)

(setq-default indent-tabs-mode nil)						;; Spaces instead of tabs
(setq-default tab-width 2)			              ;; Default tab width
(setq-default fill-column 80)                 ;; Default column width
(setq indent-line-function 'insert-tab)       ;; Indent current line(s) according to current major mode
;; Font and font size
(set-face-attribute 'default nil :font "Roboto Mono Medium")
(set-face-attribute 'default nil :height 115)

(global-set-key (kbd "M-o") #'other-window)

(setq backup-directory-alist '(("." . "~/.emacs.d/backup"))
      backup-by-copying t    ; Don't delink hardlinks
      version-control t      ; Use version numbers on backups
      delete-old-versions t  ; Automatically delete excess backups
      ;; kept-new-versions 5    ; how many of the newest versions to keep
      ;; kept-old-versions 5    ; and how many of the old
      )

(defun split-and-follow-vertically ()
  (interactive)
  (split-window-right)
  (balance-windows)
  (other-window 1))
(global-set-key (kbd "C-x 3") 'split-and-follow-vertically)

;; Emoji: 😄, 🤦, 🏴
(set-fontset-font t 'symbol "Apple Color Emoji")
(set-fontset-font t 'symbol "Noto Color Emoji" nil 'append)
(set-fontset-font t 'symbol "Segoe UI Emoji" nil 'append)
(set-fontset-font t 'symbol "Symbola" nil 'append)

(use-package vterm
  :ensure t
  :init
  (setq vterm-timer-delay 0.01))

(global-set-key (kbd "C-`") `vterm)

(use-package zenburn-theme
  :ensure t
  :config (load-theme 'zenburn t))

(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook))
;; Set the title
(setq dashboard-banner-logo-title "Welcome Johannes")
;; Set the banner
(setq dashboard-startup-banner 'logo)
;; Center content
(setq dashboard-center-content t)
;; Customize widgets
(setq dashboard-items '((recents . 5)
                        (bookmarks . 5)))
;; Disable random footnote
(setq dashboard-set-footer nil)

(add-to-list 'display-buffer-alist
             '("\*vterm\*"
               (display-buffer-in-side-window)
               (window-height . 0.275)         ;; Specify fraction of window height
               (side . bottom)
               (slot . 0)))

(setq column-number-mode t)

(use-package diminish
  :ensure t)
(diminish 'eldoc-mode)
(diminish 'visual-line-mode)
