config.org
** Change the frame title
The frame title is displayed on top of the Emacs frame and can be configured as
well. I do not look at the top of the frame often, so we will just let it
display the filename and the Emacs version for now
#+begin_src emacs-lisp :tangle yes
(setq frame-title-format '("" "[%b] - Emacs " emacs-version))
#+end_src

* Enriching Emacs functionality
** Navigating buffers
Navigating the current buffer can sometimes be a hassle as you have to press the
arrow keys or, in extreme cases, use the mouse (/shudder/). Sometimes you need
to be at very specific points in a document, and luckily for me there exists a
beautiful package that handles this: =avy=. While explaining it sounds complex,
it boils down to =M-x avy-goto-char= (rebound to =M-s=) and pressing a specific
letter or key. On each instance of the key a letter will appear and pressing
that letter will bring you immediately to that destination. Just try it!
#+begin_src emacs-lisp :tangle yes
(use-package avy
  :ensure t
  :bind ("M-s" . avy-goto-char))
#+end_src

** Interactive completion of Emacs functions
[[https://github.com/minad/vertico][Vertico]] provides us with a minimalistic vertical completion UI that is based on
the default completion system. Simple, yet powerful.
#+begin_src emacs-lisp :tangle yes
  (use-package vertico
    :ensure t
    :init (vertico-mode))
#+end_src

And let Vertico persist the history over Emacs restarts, so we can, if we want,
quickly re-open files that we opened in a previous session.
#+begin_src emacs-lisp :tangle yes
  (use-package savehist
    :init (savehist-mode))
#+end_src

As with Vertico the order of the regexp matters, it is often convenient to
invoke [[https://github.com/oantolin/orderless][Orderless]], which makes the completion style match multiple regexps in any
order. For example, I can "M-x ins pac" and "M-x package-install" will likely be
the top candidate.
#+begin_src emacs-lisp :tangle yes
  (use-package orderless
    :ensure t
    :custom
    (completion-styles '(orderless basic))
    (completion-category-overrides '((file (styles basic partial-completion)))))
#+end_src
** Show active bindings using =which-key=
[[https://github.com/justbur/emacs-which-key/][=which-key=]] is a minor mode for Emacs that displays the key bindings following
your currently entered incomplete command in a popup. This is super useful when
using new packages as you often are not aware of all the shortcuts. With
=which-key= you only have to remember the prefix, not the entire command. For
example, you can press =C-x= and after (the default of) 1 second the minibuffer
will expand with the keybindings that follow =C-x=.
#+begin_src emacs-lisp :tangle yes
  (use-package which-key
    :ensure t
    :config
    (which-key-mode)
    :diminish which-key-mode)
#+end_src
** Annotations in the minibuffer
In many cases, especially when using relatively obscure Emacs functionality, it
becomes unclear what a specific command does. [[https://github.com/minad/marginalia][Marginalia]] adds annotation in the
minibuffer that explains the function of the command. This makes it very useful
when using =M-x= functions, especially when combined with the above initialize
completion frameworks.
#+begin_src emacs-lisp :tangle yes
  (use-package marginalia
    :ensure t
    :init
    (marginalia-mode))
#+end_src

** Mini-buffer actions with Embark
When having the cursor at a specific point when using Emacs, you often need to
think about what to do with a selected region before you can do this. However,
it can be easier. [[https://github.com/oantolin/embark][Embark]] enables you to suggest what to do with a specific
selection, before you even think what to do with it. Effectively, it acts like a
'right-click' on a piece of text in any other software. Is the text a link?
Embark will suggest you to open it in a browser. Is it a list? Embark might
suggest you to order the list based on some constraints. The list goes on and
on. Embark comes with hundreds of actions preconfigures and, of course, they can
be tailored to your needs if needed.
#+begin_src emacs-lisp :tangle yes
  (use-package embark
    :ensure t
    :bind
    ("C-." . embark-act)
    :init
    :config

    ;; Hide the mode line of the Embark live/completions buffers
    (add-to-list 'display-buffer-alist
                 '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                   nil
                   (window-parameters (mode-line-format . none)))))
#+end_src

* Emacs YASnippets
No modern editor is complete without inserting large, pre-formatted textblocks
into your files with the press of a button. What separates a fast programmer (or
writer) from a slow one is basically the use of 'snippets'. For example, all
elisp source code blocks in this Org file are inserted with the =elisp_<TAB>=
button combination. I personally use [[https://github.com/joaotavora/yasnippet][YASnippet]] in combination with a popular
repository that contains snippets for a lot of modes, [[https://github.com/AndreaCrotti/yasnippet-snippets][YASnippet-snippets]].
Snippets themselves should also be included in this repository, see the
file:snippets/ directory.
#+begin_src emacs-lisp :tangle yes
  (use-package yasnippet
    :ensure t
    :diminish yas-global-mode
    :config (yas-global-mode))
  (use-package yasnippet-snippets
    :after yasnippet
    :ensure t
    :config (yasnippet-snippets-initialize))
#+end_src

* Mode-specific configurations
** Text completion using Company
[[https://company-mode.github.io/][Company]] (COMPletion ANYwhere) is a text completion framework for Emacs. It pops
up a small UI that shows you candidates for the symbols you have currently
typed, making development much faster and avoid spelling mistakes, e.g. in
function names.
#+begin_src emacs-lisp :tangle yes
  (use-package company
    :ensure t
    :diminish global-company-mode
    :hook (after-init-hook . global-company-mode))
#+end_src
** Language server
When coding one wants a so-called 'IDE-like experience', in that your text
editor recognizes previously defined function for autocompletion, displays
documentation of functions, checks syntax errors, etc. Emacs provides these
features using =lsp-mode=; a mode that supports *all* language features defined
in the Language Server Protocol (LSP). As always, Emacs' =lsp-mode= is highly
flexible and easy to configure and works well with popular Emacs packages like
=company=, =flycheck= and =projectile=.
#+begin_src emacs-lisp :tangle yes
  (use-package lsp-mode
    :ensure t  
    :commands (lsp lsp-deferred)
    :init
    ;; Usually the =lsp-keymap-prefix= is bound to "C-c l", but this is already
    ;; bound to the (very useful!) =org-store-link=, which we do not want to
    ;; override. "C-c o" ('o' for option) was empty, so use it here.
    (setq lsp-keymap-prefix "C-c o")
    :config
    (define-key lsp-mode-map (kbd lsp-keymap-prefix) lsp-command-map)
    :hook (;; add modes
           (julia-mode . lsp-deferred)
           (julia-ts-mode . lsp-deferred)
           ;; =lsp-enable-which-key-integration= gives us descriptions of what the keys
           ;; do, which helps us figure out what they do when using =lsp-mode=.
           (lsp-mode . lsp-enable-which-key-integration)))
#+end_src

*** Languages
  For =lsp-mode= to function we need to install the language server for the
  languages that we are interested in. Currently, i do most of my development in
  Julia and Python, so those will be the language servers that will be installed
  below.
  !! IMPORTANT: it is important to add a hook to =lsp-mode= for the specifical
  =<language>-mode= when defining and configuring the mode (see [[*Julia configuration][here]] for an example).
  *Languages currently supported*
  1. [[*julia][Julia]]
  2. ...
**** Julia
#+begin_src emacs-lisp :tangle yes
  (use-package lsp-julia
    :ensure t
    :config
    (setq lsp-julia-default-environment "~/.julia/environments/v1.8"))
#+end_src

** Org mode
Org mode comes with a lot of possible configurations, so these are just a very
small selection of what is actually possible.
*** Default behaviors
The default bullets of Org are quite ugly (just bullets basically), so we make
them look a little bit better. The same goes for the collapsed headers, called
the 'ellipsis'.
#+begin_src emacs-lisp :tangle yes
  (use-package org-bullets
  	:ensure t
    :config
    (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))

  (setq org-ellipsis "⤵")
#+end_src

Support shift selecting blocks of text as well, as described [[https://orgmode.org/manual/Conflicts.html][here]].
#+begin_src emacs-lisp :tangle yes
  (setq org-support-shift-select t)
#+end_src

Next up is changing the look of source code blocks (like the elisp blocks in
this Org file).
#+begin_src emacs-lisp :tangle yes
  (setq org-src-fontify-natively t)
#+end_src

Change the default behavior of Org timestamps to actually note the time
and date when logging TODO's.
#+begin_src emacs-lisp :tangle yes
  (setq org-log-done t)
#+end_src

It is inconvenient to have to =M-x auto-fill-mode= every time you open an Org
file. However, line wrapping (not only visually line wrapping, as when using
=visual-line-mode-) is basically a must. Therefore, we add a hook that enables
this every time we open an Org file.
#+begin_src emacs-lisp :tangle yes
  (add-hook 'org-mode-hook #'auto-fill-mode)
  (add-hook 'org-mode-hook #'visual-line-mode)
#+end_src

Org links are by default openen in another window (i.e. it splits the current
window in 2), which I think is undesired in many cases other than just quickly
checking the file out. To change this default behavior, we need to change the
value of =org-link-frame-setup=
#+begin_src emacs-lisp :tangle yes
  (add-to-list 'org-link-frame-setup '(file . find-file))
#+end_src

*** Global org keys
I currently do not use a lot or Org functionality, so I should update this
section on global keys and what they do when I actually have some experience
with them. 
#+begin_src emacs-lisp :tangle yes
  (global-set-key (kbd "C-c l") #'org-store-link)
  (global-set-key (kbd "C-c a") #'org-agenda)
  (global-set-key (kbd "C-c c") #'org-capture)
#+end_src

*** Org-mode configuration
**** Citation with citar
As we would like to cite items from some =.bib= file (perhaps one that is
handled by external library applications such as Zotero), we use [[https://github.com/emacs-citar/citar][Citar]].
This takes care of the dirty work and simply allows us to insert
citations as if we were writing LaTeX! We can also specify a (shared) global
bibliography and add any other (local) bibliographies within the Org files
themselves if we want.
#+begin_src emacs-lisp :tangle yes
  (use-package citar
    :custom
    (org-cite-global-bibliography '("~/work/papers/better-bibtex/postdoc.bib"))
    (org-cite-insert-processor 'citar)
    (org-cite-follow-processor 'citar)
    (org-cite-activate-processor 'citar)
    (citar-bibliography org-cite-global-bibliography)
    ;; optional: (or )rg-cite-insert is also bound to C-c C-x C-@
    :bind
    (:map org-mode-map :package org ("C-c i c" . #'org-cite-insert)))
#+end_src

To ensure that Citar works well together with [[Mini-buffer actions][Embark]] we load the =citar-embark=
package that adds contextual access in the minibuffer.
#+begin_src emacs-lisp :tangle yes
  (use-package citar-embark
    :after citar embar
    :no-require t
    :config (citar-embark-mode))
#+end_src

**** Capture templates
Within the Org-mode infrastructure, *Capture* allows you to quickly store a note
with little to no interruption of the current work flow. We  can use templates
for different types of capture items, such as TODOs. Here, we copy the example
from the Org-mode documentation that describes a template to create general TODO
entries and put these under the heading 'Tasks' in our main task =.org= file.
#+begin_src emacs-lisp :tangle yes
  (setq org-capture-templates
      '(("t" "Todo" entry (file+headline "~/work/tasks/org/todo.org" "Tasks")
         "* TODO %?\n  %i\n  %a")))
#+end_src

*** Org-roam configuration
#+begin_src emacs-lisp :tangle yes
  (use-package org-roam
    :custom
    (org-roam-directory "~/work/notes/org-roam/")
    :bind (("C-c n l" . org-roam-buffer-toggle)
           ("C-c n f" . org-roam-node-find)
           ("C-C n i" . org-roam-node-insert))
    :config (org-roam-setup))
#+end_src

