config.el

(setq frame-title-format '("" "[%b] - Emacs " emacs-version))

(use-package avy
  :ensure t
  :bind ("M-s" . avy-goto-char))

(use-package vertico
  :ensure t
  :init (vertico-mode))

(use-package savehist
  :init (savehist-mode))

(use-package orderless
  :ensure t
  :custom
  (completion-styles '(orderless basic))
  (completion-category-overrides '((file (styles basic partial-completion)))))

(use-package which-key
  :ensure t
  :config
  (which-key-mode)
  :diminish which-key-mode)

(use-package marginalia
  :ensure t
  :init
  (marginalia-mode))

(use-package embark
  :ensure t
  :bind
  ("C-." . embark-act)
  :init
  :config

  ;; Hide the mode line of the Embark live/completions buffers
  (add-to-list 'display-buffer-alist
               '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                 nil
                 (window-parameters (mode-line-format . none)))))

(use-package yasnippet
  :ensure t
  :diminish yas-global-mode
  :config (yas-global-mode))
(use-package yasnippet-snippets
  :after yasnippet
  :ensure t
  :config (yasnippet-snippets-initialize))

(use-package company
  :ensure t
  :diminish global-company-mode
  :hook (after-init-hook . global-company-mode))

(use-package lsp-mode
  :ensure t  
  :commands (lsp lsp-deferred)
  :init
  ;; Usually the =lsp-keymap-prefix= is bound to "C-c l", but this is already
  ;; bound to the (very useful!) =org-store-link=, which we do not want to
  ;; override. "C-c o" ('o' for option) was empty, so use it here.
  (setq lsp-keymap-prefix "C-c o")
  :config
  (define-key lsp-mode-map (kbd lsp-keymap-prefix) lsp-command-map)
  :hook (;; add modes
         (julia-mode . lsp-deferred)
         (julia-ts-mode . lsp-deferred)
         ;; =lsp-enable-which-key-integration= gives us descriptions of what the keys
         ;; do, which helps us figure out what they do when using =lsp-mode=.
         (lsp-mode . lsp-enable-which-key-integration)))

(use-package lsp-julia
  :ensure t
  :config
  (setq lsp-julia-default-environment "~/.julia/environments/v1.8"))

(use-package org-bullets
  :ensure t
  :config
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))

(setq org-ellipsis "⤵")

(setq org-support-shift-select t)

(setq org-src-fontify-natively t)

(setq org-log-done t)

(add-hook 'org-mode-hook #'auto-fill-mode)
(add-hook 'org-mode-hook #'visual-line-mode)

(add-to-list 'org-link-frame-setup '(file . find-file))

(global-set-key (kbd "C-c l") #'org-store-link)
(global-set-key (kbd "C-c a") #'org-agenda)
(global-set-key (kbd "C-c c") #'org-capture)

(use-package citar
  :custom
  (org-cite-global-bibliography '("~/work/papers/better-bibtex/postdoc.bib"))
  (org-cite-insert-processor 'citar)
  (org-cite-follow-processor 'citar)
  (org-cite-activate-processor 'citar)
  (citar-bibliography org-cite-global-bibliography)
  ;; optional: (or )rg-cite-insert is also bound to C-c C-x C-@
  :bind
  (:map org-mode-map :package org ("C-c i c" . #'org-cite-insert)))

(use-package citar-embark
  :after citar embar
  :no-require t
  :config (citar-embark-mode))

(setq org-capture-templates
    '(("t" "Todo" entry (file+headline "~/work/tasks/org/todo.org" "Tasks")
       "* TODO %?\n  %i\n  %a")))

(use-package org-roam
  :custom
  (org-roam-directory "~/work/notes/org-roam/")
  :bind (("C-c n l" . org-roam-buffer-toggle)
         ("C-c n f" . org-roam-node-find)
         ("C-C n i" . org-roam-node-insert))
  :config (org-roam-setup))

(use-package tex
  :ensure auctex
  :config
