config.org
**** TODO Use Org-roam more often, make a sensible configuration and write some supporting text on the configuration. 

** LaTeX configuration
LaTeX is super nice, but compiling LaTeX is not so nice. Therefore we want to
automate as much as we can so we can actually focus on writing only. This of
course includes heavy use of [[YASnippets]] (e.g. for =\align= environments), but
also includes quick (re-)compiling of =.tex= files, building a bibliography,
etc. Working with LaTeX and (external) PDF viewers could be a chapter on its
own, but most of the keybindings provides below speak for themselves. The
configuration is built on top of [[https://www.gnu.org/software/auctex/][AUCTeX]], which is an extensible package for
writing an formatting TeX files in Emacs. 
#+begin_src emacs-lisp :tangle yes
  (use-package tex
    :ensure auctex
    :config
    (setq TeX-auto-save t)
    (setq TeX-parse-self t)
    (setq-default TeX-master nil))
#+end_src
While there exist some pdf tools that can display the rendered PDF in an Emacs
window and provide Emacs functionality (such as [[https://www.emacswiki.org/emacs/IncrementalSearch][isearch]]), the viewers convert
the PDF to a PNG and thereby losing resolution. While you can fiddle with the
dpi settings, I prefer to use a better PDF-viewer instead
There are, of course, multiple options. One of the first I used happily was
[[https://wiki.gnome.org/Apps/Evince][Evince]]. For Evince, the following configuration is given.
#+begin_src emacs-lisp :tangle no
  (setq TeX-view-program-list '(("Evince" "evince --page-index=%(outpage) %o")))
  (setq TeX-view-program-selection '((output-pdf "Evince")))
#+end_src
However, I found that with Evince it is difficult to change the background color
without hacking into the source code. The white background, however, is quite a
strain on the eyes during development. And it is not pastel enough of
course. Luckily for us, there exists a PDF viewer, called [[https://pwmt.org/projects/zathura/][Zathura]], which is
highly custimizable and minimalistic. Moreover, the [[https://github.com/catppuccin/catppuccin][catppuccin team]] has made
some [[https://github.com/catppuccin/zathura][nice themes]] available for Zathura, so we use one of the themes and use
Zathura as our main PDF-viewer.
#+begin_src emacs-lisp :tangle yes
  (setq TeX-view-program-selection '((output-pdf "Zathura")))
#+end_src

Additionaly, when we recompile a TeX file we want the PDF viewer to see the
updated PDF, so we 'correlate' the TeX and the PDF.
#+begin_src emacs-lisp :tangle yes
  (add-hook 'LaTeX-mode-hook 'TeX-source-correlate-mode)
#+end_src

And update the PDF buffers after a successful LaTeX run.
#+begin_src emacs-lisp :tangle yes
  (add-hook 'TeX-after-compilation-finished-functions
            #'TeX-revert-document-buffer)
#+end_src

Finally, we change the keybinding of the 'save-render-show' procedure when in
LaTeX-mode.
** Markdown configuration
While Org mode is nice and all, I find myself reverting to Markdown in many
cases. Most often for a =README.md= that is included in a Git repository. But it
is nice to know that Org does support conversion to Markdown!
Currently, as Markdown is a super simple (and therefore useful!) text format,
the only thing I find myself using non-default behaviors is my preference of
displaying emojis -- so enable that here.
#+begin_src emacs-lisp :tangle yes
  (use-package emojify
    :hook (markdown-mode . emojify-mode))
#+end_src

** Python configuration
Currently I write most of my code in Python, so we need some code completion and
things to make writing Python code less of a chore. First, let us fix the tab width
#+begin_src emacs-lisp :tangle yes
(add-hook 'python-mode-hook
      (lambda ()
        (setq indent-tabs-mode nil)
        (setq tab-width 4)
        (setq python-indent-offset 4)))
#+end_src

*** Autocompletion
Currently I use [[http://tkf.github.io/emacs-jedi/released/#][Jedi.el]] for Python auto-completion. Besides completion is also
enables a small pop-up screen that shows information about a function or class,
code location, and more.
#+begin_src emacs-lisp :tangle yes
  (use-package jedi
    :hook (python-mode . jedi:setup)
    (setq jedi:complete-on-dot t))
#+end_src

*** IPython Notebook
As much of the current development of Python code occurs in IPython Notebooks,
such as a Jupyter Notebook, we would like to have this functionality in Emacs as
well.
Please do note that Emacs is **not** an Electron app (which is good!), so that
some IPython functionality is not supported by default. More specifically, all
things that are related to Javascript are not easily supported. This should not
discourage you from using Emacs however, as you can use the Jedi.el Python
completion backend right here in your IPython Notebook! And I can assure you
that that one is much better, and much more configurable, then Jupyter
Notebook's default code completer.

Currently, I use [[https://github.com/millejoh/emacs-ipython-notebook][Emacs Ipython Notebook (EIN)]] as it proved to be the most
successful one. The basic workflow, in order to support =conda= virtual
environments as the Python kernel, is to start a Jupyter Notebook from the
terminal and hook Emacs to that running kernel on your localhost using
=ein:login=. In this way we do not have to fiddle much with Python kernels,
virtual environments, and more. In the future we might want to make EIN know
about our virtual environments and spin up a IPython kernel itself.
#+begin_src emacs-lisp :tangle yes
  (use-package ein
  	:ensure t
    :config
    (setq ein:completion-backend 'ein:use-ac-jedi-backend))
#+end_src

** Julia configuration
I want to start writing most of my code in [[https://julialang.org/][Julia]] as it is very appealing for
scientific computing. While in general the support for Julia is not as
widespread as Python's, there is significant movement leading to a bunch of
tools (for Emacs). The most important one is [[https://github.com/JuliaEditorSupport/julia-emacs][Julia-mode]].
#+begin_src emacs-lisp :tangle no
  (use-package julia-mode
    :ensure t
    ;; Specify the hook that connects =lsp-mode=
    :hook (julia-mode-hook . lsp-mode))
#+end_src
Note: =julia-mode= does not highlight syntax very well.
#+begin_src emacs-lisp :tangle yes
  (use-package julia-ts-mode
    :ensure nil
    :load-path "~/.emacs.d/local-packages/julia-ts-mode/"
    :hook (julia-ts-mode-hook . lsp-mode))
#+end_src

The Julia REPL is quite a useful tool when writing and debugging, so we want to
add support for a good REPL in Emacs. Sadly, [[https://github.com/tpapp/julia-repl][julia-repl]] is not not available
through MELPA, so we cannot use =use-package= to automate the installation but
have to resort to manually downloading the relevant =elisp= files.
#+begin_src emacs-lisp :tangle yes
  (use-package julia-repl
    :ensure t
    :hook (julia-ts-mode . julia-repl-mode)

    :config
    ;; Set the terminal backend
    (julia-repl-set-terminal-backend 'vterm)

    ;; Keybindings for quickly sending code to the REPL
    (define-key julia-repl-mode-map (kbd "<M-RET>") 'my/julia-repl-send-cell))
#+end_src

#+begin_src emacs-lisp :tangle yes
  (defun my/julia-repl-send-cell() 
    ;; "Send the current julia cell (delimited by ###) to the julia shell"
    (interactive)
    (save-excursion
      (setq cell-begin (if (re-search-backward "^###" nil t) (point) (point-min))))
    (save-excursion
      (setq cell-end (if (re-search-forward "^###" nil t) (point) (point-max))))
    (set-mark cell-begin)
    (goto-char cell-end)
    (julia-repl-send-region-or-line)
    (next-line))
#+end_src


