config.el
  (setq TeX-auto-save t)
  (setq TeX-parse-self t)
  (setq-default TeX-master nil))

(setq TeX-view-program-list '(("Evince" "evince --page-index=%(outpage) %o")))
(setq TeX-view-program-selection '((output-pdf "Evince")))

(add-hook 'LaTeX-mode-hook 'TeX-source-correlate-mode)

(add-hook 'TeX-after-compilation-finished-functions
          #'TeX-revert-document-buffer)

(use-package emojify
  :hook (markdown-mode . emojify-mode))

(add-hook 'python-mode-hook
      (lambda ()
        (setq indent-tabs-mode nil)
        (setq tab-width 4)
        (setq python-indent-offset 4)))

(use-package jedi
  :hook (python-mode . jedi:setup)
  (setq jedi:complete-on-dot t))

(use-package ein
  :ensure t
  :config
  (setq ein:completion-backend 'ein:use-ac-jedi-backend))

(add-to-list 'load-path "~/.emacs.d/local-packages/julia-ts-mode/")
(require 'julia-ts-mode)
;; (use-package julia-ts-mode
;;   :ensure nil
;;   :load-path "~/.emacs.d/local-packages/julia-ts-mode/"
;;   :hook (julia-ts-mode-hook . lsp-mode))

(use-package julia-repl
  :ensure t
  :hook (julia-ts-mode . julia-repl-mode)

  :config
  ;; Set the terminal backend
  (julia-repl-set-terminal-backend 'vterm)

  ;; Keybindings for quickly sending code to the REPL
  (define-key julia-repl-mode-map (kbd "<M-RET>") 'my/julia-repl-send-cell))

(defun my/julia-repl-send-cell() 
  ;; "Send the current julia cell (delimited by ###) to the julia shell"
  (interactive)
  (save-excursion
    (setq cell-begin (if (re-search-backward "^###" nil t) (point) (point-min))))
  (save-excursion
    (setq cell-end (if (re-search-forward "^###" nil t) (point) (point-max))))
  (set-mark cell-begin)
  (goto-char cell-end)
  (julia-repl-send-region-or-line)
  (next-line))
